#+TITLE: Articles on EV charging stations and market trends
#+FILETAGS: :Charging:Review:
#+STARTUP: content

* EV charging stations in the US
:PROPERTIES:
:ID:       9f94c234-8138-48c1-9e67-7a97a066d91c
:END:

** Growth trend for US charging stations

The following table shows the number of public L2 and DCFC charging
stations in thousands in the US.

|--------+------+------+-------+------------+---------------|
| Date   |   L2 | DCFC | Total | Qtr growth | Annual growth |
|--------+------+------+-------+------------+---------------|
| Mar-26 | 65.7 | 14.8 |  80.5 |       1.4% |          6.9% |
| Dec-25 | 65.2 | 14.2 |  79.4 |       1.7% |         10.3% |
| Sep-25 | 64.5 | 13.6 |  78.1 |       3.7% |               |
| Jun-25 | 62.5 | 12.8 |  75.3 |       4.6% |               |
| Dec-24 | 60.0 | 12.0 |  72.0 |            |               |
|--------+------+------+-------+------------+---------------|
#+TBLFM: $4=vsum($2..$3);%.1f::@2$5..@4$5=100*($4-@+1$4)/@+1$4;%.1f%%::@2$6=100*(@2$4-@5$4)/@5$4;%.1f%%

Source: [[https://afdc.energy.gov/stations#/find/nearest?fuel=ELEC][DoE site]]

*** TODO Update [[id:9f94c234-8138-48c1-9e67-7a97a066d91c][table]] with latest information on charging sites in the US :Browser:Home:
SCHEDULED: <2026-06-28 Sun +12w>
:PROPERTIES:
:EFFORT:  00:15
:BENEFIT: 10
:RATIO: 0.40
:LAST_REPEAT: [2026-04-06 Mon 20:10]
:END:


- State "DONE"       from "TODO"       [2026-04-06 Mon 20:10]
- State "DONE"       from "TODO"       [2026-01-11 Sun 10:47]
- State "DONE"       from "TODO"       [2025-10-29 Wed 16:35]

** Composition by CPO

The composition of ports in 2024 is as follows.

|---------------------------+----------+---------------+------------+-----------------|
| Operator                  | L2 Ports | % of L2 Ports | DCFC Ports | % of DCFC Ports |
|---------------------------+----------+---------------+------------+-----------------|
| ChargePoint               |   45,000 |          ~33% | ~3,946     | ~8%             |
| Tesla Supercharger        |        0 |            0% | ~30,767    | ~60%            |
| Electrify America         |      100 |           <1% | ~4,799     | ~9%             |
| EVgo                      |      200 |           <1% | ~3,989     | ~8%             |
| Blink                     |    3,500 |           ~3% | ~175       | ~<1%            |
| Volta (Shell-owned)       |    2,000 |         ~1.5% | 0          | 0%              |
| Shell Recharge (ex-Volta) |    1,000 |         ~0.7% | ~550       | ~1%             |
| Rivian Waypoints (L2)     |      375 |           <1% | 0          | 0%              |
| Rivian Adventure (DCFC)   |        0 |            0% | ~385       | <1%             |
| Others                    |   82,825 |          ~61% | ~7299      | ~12%            |
|---------------------------+----------+---------------+------------+-----------------|
| Total (estimate)          |   135000 |          100% | ~51,500    | 100%            |
|---------------------------+----------+---------------+------------+-----------------|

ChargePoint leads the US market in L2 with 33% and Tesla in DCFC with 60%.

Source: [[https://chatgpt.com/share/685fd64f-c558-800b-ab0a-284e761978f1][ChatGPT on 28-Jun-25]] and [[https://www.rabobank.com/knowledge/d011438559-the-rise-of-electric-vehicles-in-the-us-building-a-robust-charging-network?utm_source=chatgpt.com][Rabobank research]]


* Power ratings for charging
:PROPERTIES:
:ID:       f652f1ee-71e3-4455-93bc-c090ab71254c
:END:

A standard AC socket in the US (120 V, 15 A) can give about 1.8 kW of
power. A Level 2 charger (240 V, 30 A) can provide about 7.2 kW of
power.

DC fast chargers (Level 3) can provide up to 150 kW of power. For a
70 kWh battery, that implies full charge in about 30 min. The same
full charge would take 10 hours on a level 2 charger.

A DC fast charger is equivalent to about 150 US homes at its peak
charging. Even a level 2 charger is equivalent to about 7 US homes.

However, assuming an average of 10k miles driven in a year, that
translates to a requirement of 10k/300*70 kWh/year or about 2.4
MWh/year. An average US home consumes 1.2 kW * 9000 hours/year = 11
MWh/year. So, on average, one EV will add about 20% to the energy
consumption of a house.

See discussion on [[id:c9493bda-aa50-4371-9eed-5e56699d58ba][US energy consumption]].

** When is it more economical to use gas?

If gas price is $g per gallon and gas efficiency is e miles/gallon,
then gas can get you g/e $/mile. We can calculate the same for EVs.

In MA in Jan 2026, g = 3.0, e = 30 so g/e = 0.1 $/mile.

For the RAV4 PHEV in summer, e = 40 miles/18 kWh and g = 0.33
$/kWh. Thus, g/e = 0.33*18/40 = 0.15 $/mile.

For an EV, assume e = 300 miles/70 kWh and g = 0.33 $/kWh. Thus, g/e =
0.33*70/300 = 0.07 $/mile. So, a full EV is slightly cheaper than a
gas car. However, if you can get a hybrid with an efficiency of 50
miles/hour, then the hybrid is best.

Finally, if you have solar power, of course, EVs may work out better.

Power rates are derived from [[id:5986ae17-caca-4f0e-b292-a053653165be][Electrical energy consumption]].

* OCPP

[[https://www.embedded.com/the-impact-of-ocpp-in-the-ev-industry-and-evolution-from-ocpp1-6-to-ocpp2-1][Introduction article]] on OCPP
